# รับค่า n จากผู้ใช้และแปลงเป็นจำนวนเต็ม
n = int(input())
# หาเลขหลักหน่วยของ n โดยใช้การหารเอาเศษ
d = n%10

# วนลูปตามจำนวน n แถว
for i in range(n):
    # วนลูปเพื่อพิมพ์เครื่องหมาย "-" และตัวเลข d
    for j in range(i+1):
        if i == j:
            # พิมพ์ตัวเลข d เมื่อ i เท่ากับ j (แนวทแยงมุม)
            print(d,end=" ")
        else:
            # พิมพ์เครื่องหมาย "-" ในตำแหน่งอื่นๆ
            print("-",end=" ")
    # วนลูปเพื่อพิมพ์เครื่องหมาย "+" ในส่วนที่เหลือของแถว
    for k in range (j, n-1):
        print("+",end=" ")
    # ขึ้นบรรทัดใหม่เมื่อจบแต่ละแถว
    print()